**Pandas** is a powerful Python library for data manipulation and analysis. It provides two primary data structures: **Series** and **DataFrame**.  
A **Series** is a one-dimensional labeled array capable of holding any data type (integers, strings, floats, etc.). It is similar to a column in a spreadsheet or a database table.  
A **DataFrame** is a two-dimensional, size-mutable, and heterogeneous tabular data structure with labeled axes (rows and columns). It is similar to an Excel spreadsheet or SQL table, allowing for easy data manipulation, filtering, and analysis. Pandas makes data handling efficient and intuitive.

In [ ]:
import pandas as pd

A **Pandas Series** is a one-dimensional, labeled array in Python capable of holding data of any type, such as integers, floats, strings, or Python objects. Each element in a Series has a unique label, known as its index, which allows for intuitive data selection and alignment. Series are similar to columns in a spreadsheet or a single column in a DataFrame. They support a wide range of operations, including mathematical computations, filtering, and aggregation. Series are highly flexible, making them ideal for handling and analyzing data efficiently in various data science and machine learning tasks using the Pandas library.

In [ ]:
# PANDA
import pandas as pd
data=[1,2,3,4,5,]
series= pd.Series(data)
print("Series \n", series)
print(type(series))

In [ ]:
# CREATE A SERIES FROM DICTIONARY
data= {'a':1, 'b':2, 'c':3}
series_dict = pd.Series(data)
print(series_dict)

In [ ]:
data=[10,20,30]
index=['a', 'b', 'c']
pd.Series(data,index=index)

In [ ]:
## DATAFRAMES 
## CREATE A LIST OF DICTIONERY OF LIST

data = {
    'NAME':['kRISH','jOHN', 'JACK'],
    'AGE' :[25,30,45] ,
    'CITY':['BANGLORE','NEW YORK', 'FLORIDA']

}

df= pd.DataFrame(data)
print(df)
print(type(df))

In [ ]:
##CREATE A DAT FRAME FROM A LIST OF DICTIONARIES

data = [
    {'Name': 'Krish', 'Age': 32, 'City': 'Bangalore'},
    {'Name': 'John', 'Age': 34, 'City': 'Bangalore'},
    {'Name': 'Bappy', 'Age': 32, 'City': 'Bangalore'},
    {'Name': 'Jack', 'Age': 32, 'City': 'Bangalore'}
]

df = pd.DataFrame(data)
print(df)
print(type(df))

In [ ]:
df=pd.read_csv('data.csv')
df.head(5)    ## top 5

         Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0  Product1  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North

In [ ]:
(df.head)

<bound method NDFrame.head of           Date Category  Value   Product  Sales Region
0   2023-01-01        A   28.0  Product1  754.0   East
1   2023-01-02        B   39.0  Product3  110.0  North
2   2023-01-03        C   32.0  Product2  398.0   East
3   2023-01-04        B    8.0  Product1  522.0   East
4   2023-01-05        B   26.0  Product3  869.0  North
5   2023-01-06        B   54.0  Product3  192.0   West
6   2023-01-07        A   16.0  Product1  936.0   East
7   2023-01-08        C   89.0  Product1  488.0   West
8   2023-01-09        C   37.0  Product3  772.0   West
9   2023-01-10        A   22.0  Product2  834.0   West
10  2023-01-11        B    7.0  Product1  842.0  North
11  2023-01-12        B   60.0  Product2    NaN   West
12  2023-01-13        A   70.0  Product3  628.0  South
13  2023-01-14        A   69.0  Product1  423.0   East
14  2023-01-15        A   47.0  Product2  893.0   West
15  2023-01-16        C    NaN  Product1  895.0  North
16  2023-01-17        C   93.0  Product2  511.0  South
17  2023-01-18        C    NaN  Product1  108.0   West
18  2023-01-19        A   31.0  Product2  578.0   West
19  2023-01-20        A   59.0  Product1  736.0   East
20  2023-01-21        C   82.0  Product3  606.0  South
21  2023-01-22        C   37.0  Product2  992.0  South
22  2023-01-23        B   62.0  Product3  942.0  North
23  2023-01-24        C   92.0  Product2  342.0   West
24  2023-01-25        A   24.0  Product2  458.0   East
25  2023-01-26        C   95.0  Product1  584.0   West
26  2023-01-27        C   71.0  Product2  619.0  North
27  2023-01-28        C   56.0  Product2  224.0  North
28  2023-01-29        B    NaN  Product3  617.0  North
29  2023-01-30        C   51.0  Product2  737.0  South
30  2023-01-31        B   50.0  Product3  735.0   West
31  2023-02-01        A   17.0  Product2  189.0   West
32  2023-02-02        B   63.0  Product3  338.0  South
33  2023-02-03        C   27.0  Product3    NaN   East
34  2023-02-04        C   70.0  Product3  669.0   West
35  2023-02-05        B   60.0  Product2    NaN   West
36  2023-02-06        C   36.0  Product3  177.0   East
37  2023-02-07        C    2.0  Product1    NaN  North
38  2023-02-08        C   94.0  Product1  408.0  South
39  2023-02-09        A   62.0  Product1  155.0   West
40  2023-02-10        B   15.0  Product1  578.0   East
41  2023-02-11        C   97.0  Product1  256.0   East
42  2023-02-12        A   93.0  Product3  164.0   West
43  2023-02-13        A   43.0  Product3  949.0   East
44  2023-02-14        A   96.0  Product3  830.0   East
45  2023-02-15        B   99.0  Product2  599.0   West
46  2023-02-16        B    6.0  Product1  938.0  South
47  2023-02-17        B   69.0  Product3  143.0   West
48  2023-02-18        C   65.0  Product3  182.0  North
49  2023-02-19        C   11.0  Product3  708.0  North>

In [ ]:
df.tail(5)  ## last five

          Date Category  Value   Product  Sales Region
45  2023-02-15        B   99.0  Product2  599.0   West
46  2023-02-16        B    6.0  Product1  938.0  South
47  2023-02-17        B   69.0  Product3  143.0   West
48  2023-02-18        C   65.0  Product3  182.0  North
49  2023-02-19        C   11.0  Product3  708.0  North

In [29]:
## ACCESSING DATA FROM dataframes
data

[{'Name': 'Krish', 'Age': 32, 'City': 'Bangalore'},
 {'Name': 'John', 'Age': 34, 'City': 'Bangalore'},
 {'Name': 'Bappy', 'Age': 32, 'City': 'Bangalore'},
 {'Name': 'Jack', 'Age': 32, 'City': 'Bangalore'}]

In [ ]:
df   ##df  # Shows the DataFrame in a table format in Jupyter Notebook

          Date Category  Value   Product  Sales Region
0   2023-01-01        A   28.0  Product1  754.0   East
1   2023-01-02        B   39.0  Product3  110.0  North
2   2023-01-03        C   32.0  Product2  398.0   East
3   2023-01-04        B    8.0  Product1  522.0   East
4   2023-01-05        B   26.0  Product3  869.0  North
5   2023-01-06        B   54.0  Product3  192.0   West
6   2023-01-07        A   16.0  Product1  936.0   East
7   2023-01-08        C   89.0  Product1  488.0   West
8   2023-01-09        C   37.0  Product3  772.0   West
9   2023-01-10        A   22.0  Product2  834.0   West
10  2023-01-11        B    7.0  Product1  842.0  North
11  2023-01-12        B   60.0  Product2    NaN   West
12  2023-01-13        A   70.0  Product3  628.0  South
13  2023-01-14        A   69.0  Product1  423.0   East
14  2023-01-15        A   47.0  Product2  893.0   West
15  2023-01-16        C    NaN  Product1  895.0  North
16  2023-01-17        C   93.0  Product2  511.0  South
17  2023-01-18        C    NaN  Product1  108.0   West
18  2023-01-19        A   31.0  Product2  578.0   West
19  2023-01-20        A   59.0  Product1  736.0   East
20  2023-01-21        C   82.0  Product3  606.0  South
21  2023-01-22        C   37.0  Product2  992.0  South
22  2023-01-23        B   62.0  Product3  942.0  North
23  2023-01-24        C   92.0  Product2  342.0   West
24  2023-01-25        A   24.0  Product2  458.0   East
25  2023-01-26        C   95.0  Product1  584.0   West
26  2023-01-27        C   71.0  Product2  619.0  North
27  2023-01-28        C   56.0  Product2  224.0  North
28  2023-01-29        B    NaN  Product3  617.0  North
29  2023-01-30        C   51.0  Product2  737.0  South
30  2023-01-31        B   50.0  Product3  735.0   West
31  2023-02-01        A   17.0  Product2  189.0   West
32  2023-02-02        B   63.0  Product3  338.0  South
33  2023-02-03        C   27.0  Product3    NaN   East
34  2023-02-04        C   70.0  Product3  669.0   West
35  2023-02-05        B   60.0  Product2    NaN   West
36  2023-02-06        C   36.0  Product3  177.0   East
37  2023-02-07        C    2.0  Product1    NaN  North
38  2023-02-08        C   94.0  Product1  408.0  South
39  2023-02-09        A   62.0  Product1  155.0   West
40  2023-02-10        B   15.0  Product1  578.0   East
41  2023-02-11        C   97.0  Product1  256.0   East
42  2023-02-12        A   93.0  Product3  164.0   West
43  2023-02-13        A   43.0  Product3  949.0   East
44  2023-02-14        A   96.0  Product3  830.0   East
45  2023-02-15        B   99.0  Product2  599.0   West
46  2023-02-16        B    6.0  Product1  938.0  South
47  2023-02-17        B   69.0  Product3  143.0   West
48  2023-02-18        C   65.0  Product3  182.0  North
49  2023-02-19        C   11.0  Product3  708.0  North

In [32]:
df['Value']

0     28.0
1     39.0
2     32.0
3      8.0
4     26.0
5     54.0
6     16.0
7     89.0
8     37.0
9     22.0
10     7.0
11    60.0
12    70.0
13    69.0
14    47.0
15     NaN
16    93.0
17     NaN
18    31.0
19    59.0
20    82.0
21    37.0
22    62.0
23    92.0
24    24.0
25    95.0
26    71.0
27    56.0
28     NaN
29    51.0
30    50.0
31    17.0
32    63.0
33    27.0
34    70.0
35    60.0
36    36.0
37     2.0
38    94.0
39    62.0
40    15.0
41    97.0
42    93.0
43    43.0
44    96.0
45    99.0
46     6.0
47    69.0
48    65.0
49    11.0
Name: Value, dtype: float64

In [33]:
type(df['Value'])

pandas.core.series.Series

df.loc[0] in pandas is used to access the row in the DataFrame df with the index label 0. It returns all the data for that row as a pandas Series, where the keys are the column names and the values are the corresponding data from that row.

In [34]:
df.loc[0]

Date        2023-01-01
Category             A
Value             28.0
Product       Product1
Sales            754.0
Region            East
Name: 0, dtype: object

df.iloc[0] in pandas is used to access the first row of the DataFrame df by its integer position (zero-based index). It returns that row as a pandas Series, where the keys are the column names and the values are the data from the first row.

In [35]:
df.iloc[0]

Date        2023-01-01
Category             A
Value             28.0
Product       Product1
Sales            754.0
Region            East
Name: 0, dtype: object

In [39]:
df.loc[0][1]

C:\Users\BHARTI\AppData\Local\Temp\ipykernel_7340\395987507.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.loc[0][1]

'A'

In [40]:
## ACCESING A SPECIFY LOCATION OF ELEMENTS

df['Sales']

0     754.0
1     110.0
2     398.0
3     522.0
4     869.0
5     192.0
6     936.0
7     488.0
8     772.0
9     834.0
10    842.0
11      NaN
12    628.0
13    423.0
14    893.0
15    895.0
16    511.0
17    108.0
18    578.0
19    736.0
20    606.0
21    992.0
22    942.0
23    342.0
24    458.0
25    584.0
26    619.0
27    224.0
28    617.0
29    737.0
30    735.0
31    189.0
32    338.0
33      NaN
34    669.0
35      NaN
36    177.0
37      NaN
38    408.0
39    155.0
40    578.0
41    256.0
42    164.0
43    949.0
44    830.0
45    599.0
46    938.0
47    143.0
48    182.0
49    708.0
Name: Sales, dtype: float64

In [41]:
df

          Date Category  Value   Product  Sales Region
0   2023-01-01        A   28.0  Product1  754.0   East
1   2023-01-02        B   39.0  Product3  110.0  North
2   2023-01-03        C   32.0  Product2  398.0   East
3   2023-01-04        B    8.0  Product1  522.0   East
4   2023-01-05        B   26.0  Product3  869.0  North
5   2023-01-06        B   54.0  Product3  192.0   West
6   2023-01-07        A   16.0  Product1  936.0   East
7   2023-01-08        C   89.0  Product1  488.0   West
8   2023-01-09        C   37.0  Product3  772.0   West
9   2023-01-10        A   22.0  Product2  834.0   West
10  2023-01-11        B    7.0  Product1  842.0  North
11  2023-01-12        B   60.0  Product2    NaN   West
12  2023-01-13        A   70.0  Product3  628.0  South
13  2023-01-14        A   69.0  Product1  423.0   East
14  2023-01-15        A   47.0  Product2  893.0   West
15  2023-01-16        C    NaN  Product1  895.0  North
16  2023-01-17        C   93.0  Product2  511.0  South
17  2023-01-18        C    NaN  Product1  108.0   West
18  2023-01-19        A   31.0  Product2  578.0   West
19  2023-01-20        A   59.0  Product1  736.0   East
20  2023-01-21        C   82.0  Product3  606.0  South
21  2023-01-22        C   37.0  Product2  992.0  South
22  2023-01-23        B   62.0  Product3  942.0  North
23  2023-01-24        C   92.0  Product2  342.0   West
24  2023-01-25        A   24.0  Product2  458.0   East
25  2023-01-26        C   95.0  Product1  584.0   West
26  2023-01-27        C   71.0  Product2  619.0  North
27  2023-01-28        C   56.0  Product2  224.0  North
28  2023-01-29        B    NaN  Product3  617.0  North
29  2023-01-30        C   51.0  Product2  737.0  South
30  2023-01-31        B   50.0  Product3  735.0   West
31  2023-02-01        A   17.0  Product2  189.0   West
32  2023-02-02        B   63.0  Product3  338.0  South
33  2023-02-03        C   27.0  Product3    NaN   East
34  2023-02-04        C   70.0  Product3  669.0   West
35  2023-02-05        B   60.0  Product2    NaN   West
36  2023-02-06        C   36.0  Product3  177.0   East
37  2023-02-07        C    2.0  Product1    NaN  North
38  2023-02-08        C   94.0  Product1  408.0  South
39  2023-02-09        A   62.0  Product1  155.0   West
40  2023-02-10        B   15.0  Product1  578.0   East
41  2023-02-11        C   97.0  Product1  256.0   East
42  2023-02-12        A   93.0  Product3  164.0   West
43  2023-02-13        A   43.0  Product3  949.0   East
44  2023-02-14        A   96.0  Product3  830.0   East
45  2023-02-15        B   99.0  Product2  599.0   West
46  2023-02-16        B    6.0  Product1  938.0  South
47  2023-02-17        B   69.0  Product3  143.0   West
48  2023-02-18        C   65.0  Product3  182.0  North
49  2023-02-19        C   11.0  Product3  708.0  North

In [43]:
df.at[1,'Region']

'North'

In [45]:
df.tail(5)

          Date Category  Value   Product  Sales Region
45  2023-02-15        B   99.0  Product2  599.0   West
46  2023-02-16        B    6.0  Product1  938.0  South
47  2023-02-17        B   69.0  Product3  143.0   West
48  2023-02-18        C   65.0  Product3  182.0  North
49  2023-02-19        C   11.0  Product3  708.0  North

In [50]:
## ACCESSING A SPECIFIED ELEMENT USING iat

df.iat[45,2]

np.float64(99.0)

In [ ]:
import pandas as pd

# Create a DataFrame with 4 rows and 3 columns
df = pd.DataFrame({
    'A': [1, 4, 7, 10],
    'B': [2, 5, 8, 11],
    'C': [3, 6, 9, 12]
})

print(df)           # Display the DataFrame
print(df.iat[3,2])  # Access the value at 4th row, 3rd column (should print 12)

    A   B   C
0   1   2   3
1   4   5   6
2   7   8   9
3  10  11  12
12

In [52]:
df.at[3,'A']

np.int64(10)

In [53]:
df.iat[2,1]

np.int64(8)

In [54]:
df

    A   B   C
0   1   2   3
1   4   5   6
2   7   8   9
3  10  11  12

In [ ]:
### data manipulation with dataframes
## ADDING A COLUMN 
df['Salary']= [2000,3000,1000,9000]
df

    A   B   C  Salary
0   1   2   3    2000
1   4   5   6    3000
2   7   8   9    1000
3  10  11  12    9000

In [ ]:
### REMOVE A COLUMN
df.drop('C', axis=1, inplace=True)  ## when you used inplace= true , then it will
                                     ## permanenty change otherwise , temporarly you can take the axis=1 to access it

In [64]:
df

    A   B  Salary
0   1   2    2000
1   4   5    3000
2   7   8    1000
3  10  11    9000

In [67]:
## ADD AGE TO THE COLUMN
df['A']= df['A']+5
df

    A   B  Salary
0   7   2    2000
1  10   5    3000
2  13   8    1000
3  16  11    9000

In [68]:
df.drop(0)

    A   B  Salary
1  10   5    3000
2  13   8    1000
3  16  11    9000

In [69]:
df

    A   B  Salary
0   7   2    2000
1  10   5    3000
2  13   8    1000
3  16  11    9000

In [70]:
df.drop(0,inplace=True)

In [71]:
df

    A   B  Salary
1  10   5    3000
2  13   8    1000
3  16  11    9000